// জাভাস্ক্রিপ্টে লেক্সিক্যাল স্কোপিং (Static Scoping) হলো এমন একটি মেকানিজম যা ঠিক করে যে একটি ফাংশন তার বাইরের ভেরিয়েবলগুলোকে এক্সেস করতে পারবে কি না।

// একটি ফাংশন তার নিজের ভেতর কোনো ভেরিয়েবল না পেলে, সে তার ঠিক উপরের (Parent) লেভেলে বা যেখানে তাকে ডিফাইন করা হয়েছে সেখানে গিয়ে ভেরিয়েবলটি খোঁজে। 
// এই চেইন বা খোঁজার প্রসেসটাই লেক্সিক্যাল স্কোপিং।

const myName = "Samia"; // Global Variable

function outerFunction() {
    const age = 24;

    function innerFunction() {
        const city = "Dhaka";

        console.log(myName); // Lexical Scoping - গ্লোবাল থেকে নিচ্ছে
        console.log(age); // Lexical Scoping - তার প্যারেন্ট ফাংশন থেকে নিচ্ছে
        console.log(city); // নিজের ভেতর থেকেই পাচ্ছে
    }
    innerFunction();
}

outerFunction();

// innerFunction এর ভেতর age ভেরিয়েবলটি ব্যবহার করা হলো যখন, তখন সে প্রথমে নিজের ভেতর খুঁজলো। 
// না পেয়ে এরপর প্যারেন্ট ফাংশন outerFunction এর ভেতর খুঁজলো এবং পেয়ে গেলো। একইভাবে myName 
// খুঁজতে গিয়ে প্রথমে নিজের ভেতর, এরপর প্যারেন্ট ফাংশনের ভেতর এরপর গিয়ে সে গ্লোবাল স্কোপে খুঁজলো এবং সেখানে পেয়ে গেলো।

// তবে এখানে উল্টোটা করতে গেলে অর্থাৎ outerFunction এর ভেতর থেকে city ভেরিয়েবলটি কল করলে, সেটি কাজ করবে না।
// কারণ স্কোপিং শুধুমাত্র ভেতর থেকে বাইরের দিকে কাজ করে।

// কেন একে "লেক্সিক্যাল" বলা হয়?
// "Lexical" শব্দটির অর্থ হলো কোডটি যেখানে লেখা হয়েছে সেই অবস্থানের ভিত্তিতে। অর্থাৎ, জাভাস্ক্রিপ্ট ইঞ্জিন কোডটি চালানোর আগেই (Compile টাইমে) 
// জানে কোন ফাংশনটি কার ভেতরে লেখা হয়েছে এবং কে কার ভেরিয়েবল এক্সেস করতে পারবে।

// ---------------------------------------------------------------------
let x = 10;

function first() {
    console.log(x);
}
function second() {
    let x = 20;
    first();
}

second(); // 10

// JavaScript যেহেতু Lexical Scoping অনুসরণ করে। এর মানে হলো, একটি ফাংশন যখন তৈরি বা ডিক্লেয়ার করা হয়, 
// সেটি তার আশেপাশের (parent scope) ভেরিয়েবলগুলোকে "মনে রাখে"।
// first ফাংশনটি যখন লেখা হয়েছে, তখন তার বাইরের স্কোপে (Global Scope) x এর মান ছিল ১০।
// second ফাংশনের ভেতরে first() কে কল করা হলেও, first ফাংশনটি তার জন্মের সময়কার স্কোপকেই প্রাধান্য দেয়। 
// সে second ফাংশনের ভেতরের let x = 20 কে দেখতে পায় না।
// ফাংশন কোথায় কল করা হয়েছে তার চেয়ে বড় বিষয় হলো ফাংশনটি কোথায় তৈরি করা হয়েছে।
