// 📖 স্কোপ (Scope) সহজভাবে বললে হলো একটি ভেরিয়েবলের "এলাকা" বা "সীমানা"। অর্থাৎ, 
// একটি ভেরিয়েবল আপনি কোডের কোথায় লিখলে সেটি অন্য কোথায় ব্যবহার করতে পারবেন, তা স্কোপ ঠিক করে দেয়।


// 📌 জাভাস্ক্রিপ্টে মূলত ৩ ধরণের স্কোপ নিয়ে কাজ করতে হয়:
// 1. Global Scope: যদি কোনো ভেরিয়েবল কোনো ফাংশন বা ব্লকের ( curly braces { } ) বাইরে লেখা হয়, তবে সেটি গ্লোবাল স্কোপে থাকে। 
// এটি কোডের যেকোনো জায়গা থেকে এক্সেস করা যায়।

const country = "Bangladesh" // global variable
function printCountry() {
    console.log(country); // ফাংশনের ভেতরেও কাজ করবে
}

printCountry();
console.log(country); // ফাংশনের বাইরেও কাজ করবে

// 2. Block Scope: এটিই মূলত let এবং const এর প্রধান বৈশিষ্ট্য। একটি ব্লক মানে হলো একজোড়া সেকেন্ড ব্র্যাকেট { }। যেমন if-else বা for loop এর ভেতরের অংশ।
// let এবং const দিয়ে তৈরি ভেরিয়েবল শুধুমাত্র ওই নির্দিষ্ট ব্লকের ভেতর কাজ করে। ব্লকের বাইরে এগুলোকে খুঁজে পাওয়া যায় না।

if (true) {
    let secret = "I am hidden!";
    const pi = 3.1416;
    console.log(secret); // ব্লকের ভেতরে ঠিকঠাক কাজ করবে
}

// console.log(secret); // Error. কারণ secret কেবল ওই if ব্লকের ভেতরেই বেঁচে থাকে।


// 3. Function Scope: একটি ফাংশনের ভেতরে যখন আপনি কোনো ভেরিয়েবল ডিক্লেয়ার করেন, সেটি শুধু ওই ফাংশনের ভেতরেই কাজ করে।

function sayHello() {
    var message = 'I am Damien!';
    console.log(message)
}
sayHello();

// console.log(message) // Error. ফাংশনের বাইরের দুনিয়া একে চেনে না।


// কেন আমরা var এড়িয়ে চলি?
var x = 10;
if (true) {
    var x = 20; // আগের x-কে ওভাররাইট করে ফেলবে!
}
console.log(x); // আউটপুট: 20 (হওয়ার কথা ছিল ১০)

let y = 10;
if (true) {
    let y = 20; // এটি শুধুমাত্র এই ব্লকের জন্য আলাদা y
}
console.log(y) // আউটপুট: 10 (ঠিক আছে)