// আধুনিক জাভাস্ক্রিপ্টে (ES6+) আমরা মূলত ৩টি কীওয়ার্ড ব্যবহার করি: let, const, এবং var।
// let: এটি ব্যবহার করা হয় যখন আপনি জানেন যে ভেরিয়েবলের মান পরবর্তীতে পরিবর্তন হতে পারে।
// const: এর পূর্ণরূপ হলো Constant। এটি ব্যবহার করা হয় যখন আপনি চান ভেরিয়েবলের মান একবার সেট করার পর আর কখনোই পরিবর্তন হবে না।
// var: এটি জাভাস্ক্রিপ্টের পুরনো পদ্ধতি। বর্তমানে এটি খুব একটা ব্যবহার করা হয় না কারণ এতে কিছু লজিক্যাল সমস্যা (Hoisting issues) হতে পারে।

const birthYear = 2000;

// birthYear = 2002; const can't change so that will give you Error
console.log(birthYear);


let currentBalance = 500;
currentBalance = 800; // value can be change
console.log(currentBalance);

// string + number
let userName = 'Samia';
let age = 27;
console.log("User Name: " + userName + ", Age: " + age);

// Naming Rules (ভেরিয়েবল ডিক্লেয়ার করার নিয়ম)
// 1. Camel Case: জাভাস্ক্রিপ্টে ভেরিয়েবল লেখার স্ট্যান্ডার্ড নিয়ম হলো প্রথম শব্দ ছোট হাতের এবং পরের শব্দের প্রথম অক্ষর বড় হাতের দেওয়া। যেমন: firstName
// 2. নাম অবশ্যই কোনো লেটার (a-z), আন্ডারস্কোর _ অথবা ডলার চিহ্ন $ দিয়ে শুরু হতে হবে। সংখ্যা দিয়ে শুরু করা যাবে না (যেমন: 2apple)
// 3. Case Sensitive: userName এবং username জাভাস্ক্রিপ্টে দুটি আলাদা ভেরিয়েবল হিসেবে গণ্য হবে। যে ভেরিয়েবল নেম একবার ইউজ হবে সেটা ধরেই কাজ করতে হবে।

// How Memory Works
// যখন আপনি লেখেন let score = 10;, তখন কম্পিউটার তার র‍্যামে (RAM) একটি ছোট জায়গা বরাদ্দ করে এবং সেখানে 10 লিখে রাখে। 
// আপনি যখনই score ডাকবেন, কম্পিউটার সেই জায়গা থেকে মানটি খুঁজে বের করে নিয়ে আসবে।

// 💡 Tips: প্রফেশনাল ডেভেলপার হিসেবে সবসময় চেষ্টা করা উচিত ডিফল্টভাবে const ব্যবহার করতে। 
// যদি মনে হয় মানটি পরে বদলানো দরকার, কেবল তখনই let ব্যবহার করা দরকার। এটি কোডের বাগ কমাতে সাহায্য করে।